In [69]:
import mysql.connector as connection
from mysql.connector import Error
import pandas as pd

In [70]:
try:
    mydb=connection.connect(host="localhost",user="root",passwd="Rockandroll77")
    #check if the connection is established
    query="show databases"
     
    cursor=mydb.cursor()
    cursor.execute(query)#returns as an iterable object and will be available in the last location
    res=cursor.fetchall()
    for i in res:
        print(i[0])
except Exception as e:
    mydb.close()
    print(str(e))

information_schema
jigglejiggle
mysql
performance_schema
sakila
sys
test123
test1234
world

In [71]:
# cursor.execute("create database test1234")

In [72]:
#creating a table
mydb2=connection.connect(host="localhost",database='test1234',user="root",passwd="Rockandroll77")

In [73]:
mydb2.is_connected()

True

In [74]:
cursor=mydb2.cursor()
# cursor.execute("create table table1(x1 INT(5),x2 VARCHAR(20),x3 DATE)")
mydb2.close()

In [75]:
mydb3=connection.connect(host="localhost",database='test1234',user="root",passwd="Rockandroll77")

In [76]:
mydb3.is_connected()

True

In [77]:
cursor3=mydb3.cursor()

In [78]:
cursor3.execute("insert into table1 values(4567,'sudh','10-7-22')")
mydb3.commit()

In [79]:
cursor3.execute("insert into table1 values(4567,'sudhk','10-7-22')")
cursor3.execute("insert into table1 values(4567,'sudhku','10-7-22')")
cursor3.execute("insert into table1 values(4567,'sudhkum','10-7-22')")
mydb3.commit()

In [80]:
cursor3.execute("select * from test1234.table1")
res=cursor3.fetchall()
list=[]
for i in res:
    list.append(i)
print(list)

[(4567, 'sudh', datetime.date(2010, 7, 22)), (4567, 'sudh', datetime.date(2010, 7, 22)), (4567, 'sudh', datetime.date(2010, 7, 22)), (4567, 'sudh', datetime.date(2010, 7, 22)), (4567, 'sudh', datetime.date(2010, 7, 22)), (4567, 'sudh', datetime.date(2010, 7, 22)), (4567, 'sudhk', datetime.date(2010, 7, 22)), (4567, 'sudhku', datetime.date(2010, 7, 22)), (4567, 'sudhkum', datetime.date(2010, 7, 22)), (4567, 'sudh', datetime.date(2010, 7, 22)), (4567, 'sudhk', datetime.date(2010, 7, 22)), (4567, 'sudhku', datetime.date(2010, 7, 22)), (4567, 'sudhkum', datetime.date(2010, 7, 22)), (4567, 'sudh', datetime.date(2010, 7, 22)), (4567, 'sudhk', datetime.date(2010, 7, 22)), (4567, 'sudhku', datetime.date(2010, 7, 22)), (4567, 'sudhkum', datetime.date(2010, 7, 22)), (4567, 'sudh', datetime.date(2010, 7, 22)), (4567, 'sudhk', datetime.date(2010, 7, 22)), (4567, 'sudhku', datetime.date(2010, 7, 22)), (4567, 'sudhkum', datetime.date(2010, 7, 22)), (4567, 'sudh', datetime.date(2010, 7, 22)), (4567, 'sudhk', datetime.date(2010, 7, 22)), (4567, 'sudhku', datetime.date(2010, 7, 22)), (4567, 'sudhkum', datetime.date(2010, 7, 22)), (4567, 'sudh', datetime.date(2010, 7, 22)), (4567, 'sudhk', datetime.date(2010, 7, 22)), (4567, 'sudhku', datetime.date(2010, 7, 22)), (4567, 'sudhkum', datetime.date(2010, 7, 22)), (4567, 'sudh', datetime.date(2010, 7, 22)), (4567, 'sudhk', datetime.date(2010, 7, 22)), (4567, 'sudhku', datetime.date(2010, 7, 22)), (4567, 'sudhkum', datetime.date(2010, 7, 22))]

In [81]:
cursor3=mydb3.cursor()
cursor3.execute(" select x1 ,x2 from table1")

for i in cursor3.fetchall():
    print(i)

(4567, 'sudh')
(4567, 'sudh')
(4567, 'sudh')
(4567, 'sudh')
(4567, 'sudh')
(4567, 'sudh')
(4567, 'sudhk')
(4567, 'sudhku')
(4567, 'sudhkum')
(4567, 'sudh')
(4567, 'sudhk')
(4567, 'sudhku')
(4567, 'sudhkum')
(4567, 'sudh')
(4567, 'sudhk')
(4567, 'sudhku')
(4567, 'sudhkum')
(4567, 'sudh')
(4567, 'sudhk')
(4567, 'sudhku')
(4567, 'sudhkum')
(4567, 'sudh')
(4567, 'sudhk')
(4567, 'sudhku')
(4567, 'sudhkum')
(4567, 'sudh')
(4567, 'sudhk')
(4567, 'sudhku')
(4567, 'sudhkum')
(4567, 'sudh')
(4567, 'sudhk')
(4567, 'sudhku')
(4567, 'sudhkum')

In [82]:
import pandas as pd

In [83]:
a=pd.read_sql("select x1,x2 from test1234.table1",mydb3)

c:\Users\satab\anaconda3\envs\MYSQL\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [84]:
a

      x1       x2
0   4567     sudh
1   4567     sudh
2   4567     sudh
3   4567     sudh
4   4567     sudh
5   4567     sudh
6   4567    sudhk
7   4567   sudhku
8   4567  sudhkum
9   4567     sudh
10  4567    sudhk
11  4567   sudhku
12  4567  sudhkum
13  4567     sudh
14  4567    sudhk
15  4567   sudhku
16  4567  sudhkum
17  4567     sudh
18  4567    sudhk
19  4567   sudhku
20  4567  sudhkum
21  4567     sudh
22  4567    sudhk
23  4567   sudhku
24  4567  sudhkum
25  4567     sudh
26  4567    sudhk
27  4567   sudhku
28  4567  sudhkum
29  4567     sudh
30  4567    sudhk
31  4567   sudhku
32  4567  sudhkum

In [85]:
# a.to_csv("mydata.csv")

In [86]:
cursor=mydb3.cursor()
# cursor.execute("create table mydata(n1 int(20),n2 varchar(20),n3 date)")

In [87]:
data=pd.read_csv("mydata.csv")

In [88]:
data1=pd.read_sql('select * from table1',mydb)
data1.to_sql('mydata',mydb3)

c:\Users\satab\anaconda3\envs\MYSQL\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

DatabaseError: Execution failed on sql 'SELECT name FROM sqlite_master WHERE type='table' AND name=?;': Not all parameters were used in the SQL statement